99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/http/esp32_mquickjs_http_server.c
#include "esp32_mquickjs_http_server.h"
#include "esp32_mquickjs_memory.h"

#if CONFIG_ESP32_MQUICKJS_FEATURE_HTTP_SERVER

#include "esp32_mquickjs_core.h"
#include "esp32_mquickjs_event_queue.h"
#include "esp32_mquickjs_future.h"
#include "esp32_mquickjs_http_server_resources.h"
#include "esp32_mquickjs_net.h"
#include "utils/esp32_mquickjs_request_response.h"
#include "esp32_mquickjs_stream.h"

#include <ctype.h>
#include <errno.h>
#include <inttypes.h>
#include <stdatomic.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "esp_heap_caps.h"
#include "esp_http_server.h"
#include "esp_log.h"
#include "esp_netif.h"
#include "freertos/FreeRTOS.h"
#include "freertos/queue.h"
#include "freertos/semphr.h"

#define ESP32_MQUICKJS_HTTP_SERVER_MAX_SERVERS 2
#define ESP32_MQUICKJS_HTTP_SERVER_MAX_ROUTES 16
#define ESP32_MQUICKJS_HTTP_SERVER_QUEUE_LEN 8
#define ESP32_MQUICKJS_HTTP_SERVER_MAX_BODY_LEN 8192
#define ESP32_MQUICKJS_HTTP_SERVER_MAX_HEADERS 16
#define ESP32_MQUICKJS_HTTP_SERVER_STREAM_CHUNK_SIZE 1024

typedef struct {
    char *key;
    char *value;
} esp32_mquickjs_http_server_header_t;

typedef struct {
    bool allocated;
    uint8_t server_id;
    uint32_t generation;
    uint16_t port;
    uint16_t ctrl_port;
    char *host;
    bool started;
    bool release_pending;
    httpd_handle_t handle;
    httpd_uri_t dispatch_uri;
    esp32_mquickjs_event_queue_t *events;
} esp32_mquickjs_http_server_slot_t;

typedef struct {
    bool allocated;
    uint8_t route_id;
    uint8_t server_id;
    httpd_method_t method;
    char *uri;
    char *mount_path;
    bool match_with_regex;
    bool registered;
    httpd_uri_t uri_def;
} esp32_mquickjs_http_server_route_t;

typedef struct {
    bool allocated;
    bool responding;
    uint8_t request_id;
    uint32_t generation;
    uint8_t server_id;
    httpd_req_t *async_req;
    char *method;
    char *path;
    char *query_string;
    uint8_t *body;
    size_t body_len;
    esp32_mquickjs_http_server_header_t *headers;
    size_t header_count;
} esp32_mquickjs_http_server_request_t;

typedef struct {
    uint8_t request_id;
    uint32_t generation;
} esp32_mquickjs_http_server_event_t;

typedef struct {
    uint8_t server_id;
    uint32_t generation;
} esp32_mquickjs_http_server_event_source_t;

typedef struct {
    uint8_t server_id;
    uint32_t generation;
} esp32_mquickjs_http_server_ref_t;

typedef struct {
    bool initialized;
    bool shutting_down;
    esp32_mquickjs_runtime_t *runtime;
    SemaphoreHandle_t lock;
    esp32_mquickjs_http_server_slot_t servers[ESP32_MQUICKJS_HTTP_SERVER_MAX_SERVERS];
    esp32_mquickjs_http_server_route_t routes[ESP32_MQUICKJS_HTTP_SERVER_MAX_ROUTES];
    esp32_mquickjs_http_server_request_t requests[ESP32_MQUICKJS_HTTP_SERVER_QUEUE_LEN];
} esp32_mquickjs_http_server_state_t;

typedef struct {
    int32_t status;
    char *status_text;
    bool has_body_stream;
    bool body_binary;
    bool has_known_length;
    size_t known_length;
    esp32_mquickjs_fs_stream_ref_t body_stream_ref;
    esp32_mquickjs_http_server_header_t *headers;
    size_t header_count;
} esp32_mquickjs_http_server_response_t;

static const char *TAG = "esp32qjs_httpd";
static esp32_mquickjs_http_server_state_t s_http_server_state;

static bool http_server_glob_match(const char *pattern, const char *text);
static void http_server_close_request_body(JSContext *ctx,
                                           JSValue request_value);
static esp_err_t http_server_stop_slot(
    esp32_mquickjs_http_server_slot_t *server);
static esp_err_t http_server_close_slot(
    JSContext *ctx, esp32_mquickjs_http_server_slot_t *server);
static esp_err_t http_server_cleanup_all(JSContext *ctx);
static void http_server_reset_state(void);

static httpd_method_t http_server_method_from_name(const char *method_name)
{
    if (method_name == NULL) {
        return HTTP_ANY;
    }
    if (strcmp(method_name, "GET") == 0) {
        return HTTP_GET;
    }
    if (strcmp(method_name, "POST") == 0) {
        return HTTP_POST;
    }
    if (strcmp(method_name, "PUT") == 0) {
        return HTTP_PUT;
    }
    if (strcmp(method_name, "PATCH") == 0) {
        return HTTP_PATCH;
    }
    if (strcmp(method_name, "DELETE") == 0) {
        return HTTP_DELETE;
    }
    if (strcmp(method_name, "HEAD") == 0) {
        return HTTP_HEAD;
    }
    if (strcmp(method_name, "OPTIONS") == 0) {
        return HTTP_OPTIONS;
    }
    return HTTP_ANY;
}

static JSValue http_server_call_function(JSContext *ctx,
                                         JSValue func,
                                         JSValue this_val,
                                         int argc,
                                         JSValue *argv)
{
    return esp32_mquickjs_call(ctx,
                               esp32_mquickjs_get_active_runtime(),
                               func,
                               this_val,
                               argc,
                               argv);
}

static bool http_server_is_object(JSContext *ctx, JSValue value)
{
    (void)ctx;
    return JS_GetClassID(ctx, value) >= 0;
}

static void http_server_lock(void)
{
    if (s_http_server_state.lock != NULL) {
        xSemaphoreTake(s_http_server_state.lock, portMAX_DELAY);
    }
}

static void http_server_unlock(void)
{
    if (s_http_server_state.lock != NULL) {
        xSemaphoreGive(s_http_server_state.lock);
    }
}

static char *http_server_strdup(const char *value)
{
    size_t len;
    char *copy;

    if (value == NULL) {
        return NULL;
    }

    len = strlen(value);
    copy = heap_caps_malloc(len + 1, MALLOC_CAP_8BIT);
    if (copy == NULL) {
        return NULL;
    }
    memcpy(copy, value, len + 1);
    return copy;
}

static void http_server_free_headers(esp32_mquickjs_http_server_header_t *headers, size_t count)
{
    size_t i;

    if (headers == NULL) {
        return;
    }
    for (i = 0; i < count; ++i) {
        heap_caps_free(headers[i].key);
        heap_caps_free(headers[i].value);
    }
    heap_caps_free(headers);
}

static void http_server_free_response(esp32_mquickjs_http_server_response_t *response)
{
    if (response == NULL) {
        return;
    }
    if (response->has_body_stream) {
        esp32_mquickjs_fs_stream_close(&response->body_stream_ref);
    }
    heap_caps_free(response->status_text);
    http_server_free_headers(response->headers, response->header_count);
    memset(response, 0, sizeof(*response));
}

static void http_server_cleanup_request(esp32_mquickjs_http_server_request_t *request)
{
    uint8_t request_id;
    uint32_t generation;

