99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/http/esp32_mquickjs_http_server.c
    if (request == NULL || !request->allocated) {
        return;
    }

    request_id = request->request_id;
    generation = request->generation;
    if (request->async_req != NULL) {
        httpd_req_async_handler_complete(request->async_req);
    }
    heap_caps_free(request->method);
    heap_caps_free(request->path);
    heap_caps_free(request->query_string);
    esp32_mquickjs_memory_payload_free(request->body);
    http_server_free_headers(request->headers, request->header_count);
    http_server_lock();
    memset(request, 0, sizeof(*request));
    request->request_id = request_id;
    request->generation = generation;
    http_server_unlock();
}

static void http_server_cleanup_route(JSContext *ctx, esp32_mquickjs_http_server_route_t *route)
{
    if (route == NULL || !route->allocated) {
        return;
    }

    (void)ctx;
    heap_caps_free(route->uri);
    heap_caps_free(route->mount_path);
    memset(route, 0, sizeof(*route));
}

static void http_server_cleanup_server(esp32_mquickjs_http_server_slot_t *server)
{
    uint8_t server_id;
    uint32_t generation;

    if (server == NULL || !server->allocated) {
        return;
    }
    server_id = server->server_id;
    generation = server->generation;
    heap_caps_free(server->host);
    memset(server, 0, sizeof(*server));
    server->server_id = server_id;
    server->generation = generation;
}

static const char *http_server_status_text(int32_t status)
{
    switch (status) {
    case 200:
        return "OK";
    case 201:
        return "Created";
    case 202:
        return "Accepted";
    case 204:
        return "No Content";
    case 400:
        return "Bad Request";
    case 401:
        return "Unauthorized";
    case 403:
        return "Forbidden";
    case 404:
        return "Not Found";
    case 405:
        return "Method Not Allowed";
    case 408:
        return "Request Timeout";
    case 409:
        return "Conflict";
    case 413:
        return "Payload Too Large";
    case 500:
        return "Internal Server Error";
    case 503:
        return "Service Unavailable";
    default:
        return "OK";
    }
}

static bool http_server_host_is_any(const char *host)
{
    return host == NULL || host[0] == '\0' || strcmp(host, "0.0.0.0") == 0;
}

static bool http_server_resolve_ifreq_for_host(const char *host, struct ifreq *out_ifr)
{
    esp_netif_t *netif = NULL;
    uint32_t target_ip = 0;

    if (out_ifr == NULL) {
        return false;
    }
    memset(out_ifr, 0, sizeof(*out_ifr));

    if (http_server_host_is_any(host)) {
        return true;
    }

    target_ip = esp_ip4addr_aton(host);
    if (target_ip == 0) {
        return false;
    }

    while ((netif = esp_netif_next_unsafe(netif)) != NULL) {
        esp_netif_ip_info_t ip_info;

        if (esp_netif_get_ip_info(netif, &ip_info) != ESP_OK) {
            continue;
        }
        if (ip_info.ip.addr != target_ip) {
            continue;
        }
        if (esp_netif_get_netif_impl_name(netif, out_ifr->ifr_name) != ESP_OK) {
            return false;
        }
        return out_ifr->ifr_name[0] != '\0';
    }
    return false;
}

static esp_err_t http_server_init_state(JSContext *ctx,
                                        esp32_mquickjs_runtime_t *runtime)
{
    esp_err_t err;
    int i;

    if (s_http_server_state.initialized) {
        if (s_http_server_state.shutting_down) {
            err = http_server_cleanup_all(ctx);
            if (err != ESP_OK) {
                return err;
            }
            http_server_reset_state();
        } else {
            if (runtime != NULL) {
                s_http_server_state.runtime = runtime;
            }
            return ESP_OK;
        }
    }

    memset(&s_http_server_state, 0, sizeof(s_http_server_state));
    s_http_server_state.lock = xSemaphoreCreateMutex();
    if (s_http_server_state.lock == NULL) {
        memset(&s_http_server_state, 0, sizeof(s_http_server_state));
        return ESP_ERR_NO_MEM;
    }

    for (i = 0; i < ESP32_MQUICKJS_HTTP_SERVER_MAX_SERVERS; ++i) {
        s_http_server_state.servers[i].server_id = (uint8_t)i;
    }
    for (i = 0; i < ESP32_MQUICKJS_HTTP_SERVER_MAX_ROUTES; ++i) {
        s_http_server_state.routes[i].route_id = (uint8_t)i;
    }
    for (i = 0; i < ESP32_MQUICKJS_HTTP_SERVER_QUEUE_LEN; ++i) {
        s_http_server_state.requests[i].request_id = (uint8_t)i;
    }

    s_http_server_state.runtime = runtime;
    s_http_server_state.initialized = true;
    return ESP_OK;
}

static void http_server_reset_state(void)
{
    if (s_http_server_state.lock != NULL) {
        vSemaphoreDelete(s_http_server_state.lock);
    }
    memset(&s_http_server_state, 0, sizeof(s_http_server_state));
}

static esp32_mquickjs_http_server_slot_t *http_server_get_slot(int32_t server_id)
{
    if (server_id < 0 || server_id >= ESP32_MQUICKJS_HTTP_SERVER_MAX_SERVERS) {
        return NULL;
    }
    if (!s_http_server_state.servers[server_id].allocated) {
        return NULL;
    }
    return &s_http_server_state.servers[server_id];
}

static esp32_mquickjs_http_server_request_t *http_server_alloc_request(void)
{
    esp32_mquickjs_http_server_request_t *request = NULL;
    int i;

    http_server_lock();
    for (i = 0; i < ESP32_MQUICKJS_HTTP_SERVER_QUEUE_LEN; ++i) {
        if (!s_http_server_state.requests[i].allocated) {
            request = &s_http_server_state.requests[i];
            request->allocated = true;
            request->generation++;
            if (request->generation == 0) {
                request->generation++;
            }
            break;
        }
    }
    http_server_unlock();
    return request;
}

static bool http_server_parse_path_and_query(const char *uri, char **out_path, char **out_query)
{
    const char *query;
    size_t path_len;
    char *path;

    *out_path = NULL;
    *out_query = NULL;

    if (uri == NULL) {
        return false;
    }

    query = strchr(uri, '?');
    if (query == NULL) {
        *out_path = http_server_strdup(uri);
        return *out_path != NULL;
    }

    path_len = (size_t)(query - uri);
    path = heap_caps_malloc(path_len + 1, MALLOC_CAP_8BIT);
    if (path == NULL) {
        return false;
    }
    memcpy(path, uri, path_len);
    path[path_len] = '\0';

