99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/http/esp32_mquickjs_http_server.c
    *out_path = path;
    *out_query = http_server_strdup(query + 1);
    if (*out_query == NULL) {
        heap_caps_free(path);
        *out_path = NULL;
        return false;
    }
    return true;
}

static int http_server_hex_value(char c)
{
    if (c >= '0' && c <= '9') {
        return c - '0';
    }
    if (c >= 'a' && c <= 'f') {
        return c - 'a' + 10;
    }
    if (c >= 'A' && c <= 'F') {
        return c - 'A' + 10;
    }
    return -1;
}

static char *http_server_url_decode(const char *value)
{
    size_t len;
    char *out;
    size_t i;
    size_t j = 0;

    if (value == NULL) {
        return http_server_strdup("");
    }

    len = strlen(value);
    out = heap_caps_malloc(len + 1, MALLOC_CAP_8BIT);
    if (out == NULL) {
        return NULL;
    }

    for (i = 0; i < len; ++i) {
        if (value[i] == '%' && i + 2 < len) {
            int hi = http_server_hex_value(value[i + 1]);
            int lo = http_server_hex_value(value[i + 2]);

            if (hi >= 0 && lo >= 0) {
                out[j++] = (char)((hi << 4) | lo);
                i += 2;
                continue;
            }
        }
        if (value[i] == '+') {
            out[j++] = ' ';
        } else {
            out[j++] = value[i];
        }
    }
    out[j] = '\0';
    return out;
}

static bool http_server_capture_headers(httpd_req_t *req,
                                        esp32_mquickjs_http_server_header_t **out_headers,
                                        size_t *out_count)
{
    static const char *fields[] = {
        "host",
        "user-agent",
        "accept",
        "accept-encoding",
        "content-type",
        "content-length",
        "authorization",
        "cookie",
        "connection",
        "origin",
        "referer",
    };
    esp32_mquickjs_http_server_header_t *headers = NULL;
    size_t count = 0;
    size_t i;

    *out_headers = NULL;
    *out_count = 0;
    headers = heap_caps_calloc(sizeof(fields) / sizeof(fields[0]), sizeof(*headers), MALLOC_CAP_8BIT);
    if (headers == NULL) {
        return false;
    }

    for (i = 0; i < sizeof(fields) / sizeof(fields[0]); ++i) {
        size_t len = httpd_req_get_hdr_value_len(req, fields[i]);
        char *value;

        if (len == 0) {
            continue;
        }
        value = heap_caps_malloc(len + 1, MALLOC_CAP_8BIT);
        if (value == NULL) {
            http_server_free_headers(headers, count);
            return false;
        }
        if (httpd_req_get_hdr_value_str(req, fields[i], value, len + 1) != ESP_OK) {
            heap_caps_free(value);
            continue;
        }
        headers[count].key = http_server_strdup(fields[i]);
        headers[count].value = value;
        if (headers[count].key == NULL) {
            heap_caps_free(value);
            http_server_free_headers(headers, count);
            return false;
        }
        count++;
    }

    *out_headers = headers;
    *out_count = count;
    return true;
}

static bool http_server_compile_route_pattern(JSContext *ctx,
                                              JSValue *pattern_value,
                                              esp32_mquickjs_http_server_route_t *route)
{
    JSCStringBuf uri_buf;
    const char *uri = NULL;

    if (route == NULL) {
        return false;
    }

    if (JS_IsString(ctx, *pattern_value)) {
        uri = JS_ToCString(ctx, *pattern_value, &uri_buf);
        if (uri == NULL) {
            return false;
        }
        route->uri = http_server_strdup(uri);
        if (route->uri == NULL) {
            return false;
        }
        if (strchr(uri, '*') == NULL) {
            route->match_with_regex = false;
            return true;
        }
        {
            const char *wildcard = strchr(uri, '*');
            size_t prefix_len = (size_t)(wildcard - uri);

            route->mount_path = heap_caps_malloc(prefix_len + 1, MALLOC_CAP_8BIT);
            if (route->mount_path == NULL) {
                return false;
            }
            memcpy(route->mount_path, uri, prefix_len);
            route->mount_path[prefix_len] = '\0';
        }
        route->match_with_regex = true;
        return true;
    }

    return false;
}

static bool http_server_glob_match(const char *pattern, const char *text)
{
    const char *star = NULL;
    const char *retry = NULL;

    if (pattern == NULL || text == NULL) {
        return false;
    }

    while (*text != '\0') {
        if (*pattern == '*') {
            star = pattern++;
            retry = text;
            continue;
        }
        if (*pattern == *text) {
            pattern++;
            text++;
            continue;
        }
        if (star != NULL) {
            pattern = star + 1;
            text = ++retry;
            continue;
        }
        return false;
    }

    while (*pattern == '*') {
        pattern++;
    }
    return *pattern == '\0';
}

static uint8_t *http_server_recv_body(httpd_req_t *req,
                                      size_t max_len,
                                      size_t *out_len,
                                      esp_err_t *out_err)
{
    size_t remaining;
    size_t offset = 0;
    uint8_t *body;

    *out_err = ESP_OK;
    *out_len = 0;
    if (req->content_len == 0) {
        return NULL;
    }
    if (req->content_len > max_len) {
        *out_err = ESP_ERR_HTTPD_RESP_SEND;
        return NULL;
    }

    body = esp32_mquickjs_memory_payload_alloc(
        "http-server.body", req->content_len,
        ESP32_MQUICKJS_MEMORY_EXTERNAL);
    if (body == NULL) {
        *out_err = ESP_ERR_NO_MEM;
        return NULL;
    }

    remaining = req->content_len;
    while (remaining > 0) {
        int received = httpd_req_recv(req, (char *)(body + offset), remaining);

        if (received <= 0) {
            esp32_mquickjs_memory_payload_free(body);
            *out_err = received == HTTPD_SOCK_ERR_TIMEOUT ? ESP_ERR_TIMEOUT : ESP_FAIL;
            return NULL;
        }
        offset += (size_t)received;
        remaining -= (size_t)received;
    }

    *out_len = offset;
    return body;
}

static esp_err_t http_server_send_error(httpd_req_t *req, int32_t status, const char *message)
{
    char status_line[32];
    const char *reason = http_server_status_text(status);

    snprintf(status_line, sizeof(status_line), "%" PRId32 " %s", status, reason);
    httpd_resp_set_status(req, status_line);
    httpd_resp_set_type(req, "text/plain; charset=utf-8");
    return httpd_resp_sendstr(req, message != NULL ? message : "");
}

static esp32_mquickjs_http_server_route_t *http_server_find_route(JSContext *ctx,
                                                                  uint8_t server_id,
                                                                  const char *method_name,
                                                                  const char *path)
{
    int i;
    httpd_method_t method = http_server_method_from_name(method_name);

    (void)ctx;

    for (i = 0; i < ESP32_MQUICKJS_HTTP_SERVER_MAX_ROUTES; ++i) {
        esp32_mquickjs_http_server_route_t *route = &s_http_server_state.routes[i];

        if (!route->allocated || route->server_id != server_id || route->uri == NULL) {
            continue;
        }
        if (route->method != HTTP_ANY && route->method != method) {
            continue;
        }
        if (route->match_with_regex) {
            if (http_server_glob_match(route->uri, path != NULL ? path : "")) {
                return route;
            }
        } else if (strcmp(route->uri, path) == 0) {
            return route;
        }
    }
    return NULL;
}

