99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/http/esp32_mquickjs_http_server.c
static esp_err_t http_server_dispatch_handler(httpd_req_t *req)
{
    esp32_mquickjs_http_server_slot_t *server = req != NULL ? req->user_ctx : NULL;
    esp32_mquickjs_http_server_request_t *request;
    esp32_mquickjs_http_server_event_t event;
    httpd_req_t *async_req = NULL;
    esp_err_t err = ESP_OK;
    char *path = NULL;
    char *query_string = NULL;

    if (server == NULL || !server->allocated || server->release_pending ||
        s_http_server_state.shutting_down) {
        if (req != NULL) {
            http_server_send_error(req, 503, "server shutting down");
        }
        return ESP_FAIL;
    }
    if (!http_server_parse_path_and_query(req->uri, &path, &query_string)) {
        http_server_send_error(req, 500, "out of memory");
        return ESP_FAIL;
    }

    request = http_server_alloc_request();
    if (request == NULL) {
        heap_caps_free(path);
        heap_caps_free(query_string);
        http_server_send_error(req, 503, "server busy");
        return ESP_FAIL;
    }

    err = httpd_req_async_handler_begin(req, &async_req);
    if (err != ESP_OK || async_req == NULL) {
        http_server_cleanup_request(request);
        heap_caps_free(path);
        heap_caps_free(query_string);
        http_server_send_error(req, 500, "failed to start async request");
        return ESP_FAIL;
    }

    request->server_id = server->server_id;
    request->async_req = async_req;
    request->path = path;
    request->query_string = query_string;
    request->method = http_server_strdup(req->method == HTTP_POST ? "POST" :
                                         req->method == HTTP_PUT ? "PUT" :
                                         req->method == HTTP_DELETE ? "DELETE" :
                                         req->method == HTTP_PATCH ? "PATCH" :
                                         req->method == HTTP_HEAD ? "HEAD" :
                                         req->method == HTTP_OPTIONS ? "OPTIONS" : "GET");
    if (request->method == NULL) {
        http_server_send_error(async_req, 500, "out of memory");
        http_server_cleanup_request(request);
        return ESP_OK;
    }
    if (!http_server_capture_headers(async_req, &request->headers, &request->header_count)) {
        http_server_send_error(async_req, 500, "failed to capture request headers");
        http_server_cleanup_request(request);
        return ESP_OK;
    }

    request->body = http_server_recv_body(
        async_req, ESP32_MQUICKJS_HTTP_SERVER_MAX_BODY_LEN,
        &request->body_len, &err);
    if (request->body == NULL && err != ESP_OK) {
        if (err == ESP_ERR_HTTPD_RESP_SEND) {
            http_server_send_error(async_req, 413, "request body too large");
        } else {
            http_server_send_error(async_req, 500, "failed to read request body");
        }
        http_server_cleanup_request(request);
        return ESP_OK;
    }

    event.request_id = request->request_id;
    event.generation = request->generation;
    if (server->events == NULL ||
        !esp32_mquickjs_event_queue_send(server->events, &event)) {
        http_server_send_error(async_req, 503, "request queue full");
        http_server_cleanup_request(request);
        return ESP_OK;
    }

    return ESP_OK;
}

static bool http_server_make_request_object(JSContext *ctx,
                                            esp32_mquickjs_http_server_request_t *request,
                                            const esp32_mquickjs_http_server_route_t *route,
                                            JSValue *out_obj)
{
    JSGCRef global_ref;
    JSGCRef query_ref;
    JSGCRef headers_ref;
    JSGCRef headers_value_ref;
    JSGCRef body_ref;
    JSValue *global_obj;
    JSValue *query_obj;
    JSValue *headers_plain;
    JSValue *headers_value;
    JSValue *body_value;
    char *url = NULL;
    const char *route_text;
    const char *mount_path;
    const char *relative_path;
    size_t i;

    if (request == NULL || out_obj == NULL) {
        return false;
    }

    global_obj = JS_PushGCRef(ctx, &global_ref);
    query_obj = JS_PushGCRef(ctx, &query_ref);
    headers_plain = JS_PushGCRef(ctx, &headers_ref);
    headers_value = JS_PushGCRef(ctx, &headers_value_ref);
    body_value = JS_PushGCRef(ctx, &body_ref);
    *global_obj = JS_GetGlobalObject(ctx);
    *query_obj = JS_NewObject(ctx);
    *headers_plain = JS_NewObject(ctx);
    *headers_value = JS_UNDEFINED;
    *body_value = JS_UNDEFINED;
    if (JS_IsException(*global_obj) || JS_IsException(*query_obj) || JS_IsException(*headers_plain)) {
        goto fail;
    }

    for (i = 0; i < request->header_count; ++i) {
        if (!esp32_mquickjs_set_property_ref(ctx,
                                         headers_plain,
                                         request->headers[i].key,
                                         JS_NewString(ctx, request->headers[i].value))) {
            goto fail;
        }
    }

    if (request->query_string != NULL && request->query_string[0] != '\0') {
        const char *cursor = request->query_string;

        while (*cursor != '\0') {
            const char *segment_start = cursor;
            const char *separator;
            const char *equals;
            size_t key_len;
            size_t value_len;
            char *key_raw;
            char *value_raw;
            char *key;
            char *value;

            while (*cursor != '\0' && *cursor != '&') {
                cursor++;
            }
            separator = cursor;
            if (*cursor == '&') {
                cursor++;
            }

            equals = memchr(segment_start, '=', (size_t)(separator - segment_start));
            key_len = equals != NULL ? (size_t)(equals - segment_start) : (size_t)(separator - segment_start);
            value_len = equals != NULL ? (size_t)(separator - equals - 1) : 0;

            key_raw = heap_caps_malloc(key_len + 1, MALLOC_CAP_8BIT);
            value_raw = heap_caps_malloc(value_len + 1, MALLOC_CAP_8BIT);
            if (key_raw == NULL || value_raw == NULL) {
                heap_caps_free(key_raw);
                heap_caps_free(value_raw);
                goto fail;
            }
            memcpy(key_raw, segment_start, key_len);
            key_raw[key_len] = '\0';
            memcpy(value_raw, equals != NULL ? equals + 1 : "", value_len);
            value_raw[value_len] = '\0';
            key = http_server_url_decode(key_raw);
            value = http_server_url_decode(value_raw);
            heap_caps_free(key_raw);
            heap_caps_free(value_raw);
            if (key == NULL || value == NULL) {
                heap_caps_free(key);
                heap_caps_free(value);
                goto fail;
            }
            if (key[0] != '\0' &&
                !esp32_mquickjs_set_property_ref(ctx, query_obj, key, JS_NewString(ctx, value))) {
                heap_caps_free(key);
                heap_caps_free(value);
                goto fail;
            }
            heap_caps_free(key);
            heap_caps_free(value);
        }
    }

    if (request->header_count > 0 && request->headers[0].value != NULL) {
        const char *host = NULL;
        size_t url_len;

        for (i = 0; i < request->header_count; ++i) {
            if (strcasecmp(request->headers[i].key, "host") == 0) {
                host = request->headers[i].value;
                break;
            }
        }
        if (host != NULL) {
            url_len = strlen(host) + strlen(request->path != NULL ? request->path : "/") +
                      strlen(request->query_string != NULL ? request->query_string : "") + 9;
            url = heap_caps_malloc(url_len, MALLOC_CAP_8BIT);
            if (url == NULL) {
                goto fail;
            }
            snprintf(url, url_len, "http://%s%s%s%s",
                     host,
                     request->path != NULL ? request->path : "/",
                     (request->query_string != NULL && request->query_string[0] != '\0') ? "?" : "",
                     request->query_string != NULL ? request->query_string : "");
        }
    }

