99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/http/esp32_mquickjs_http_server.c
    *headers_value = esp32_mquickjs_make_headers_object(ctx, *global_obj, *headers_plain);
    if (JS_IsException(*headers_value)) {
        goto fail;
    }

    route_text = route != NULL && route->uri != NULL ? route->uri :
        (request->path != NULL ? request->path : "/");
    mount_path = route != NULL && route->mount_path != NULL ? route->mount_path : "";
    relative_path = "";
    if (request->path != NULL && route != NULL && route->mount_path != NULL) {
        size_t mount_len = strlen(route->mount_path);
        if (strncmp(request->path, route->mount_path, mount_len) == 0) {
            relative_path = request->path + mount_len;
            while (*relative_path == '/') {
                relative_path++;
            }
        }
    }

    *body_value = esp32_mquickjs_stream_open_memory_owned_binary(
        ctx, *global_obj, request->body, request->body_len);
    request->body = NULL;
    request->body_len = 0;
    if (JS_IsException(*body_value)) {
        goto fail;
    }

    *out_obj = esp32_mquickjs_make_request_object(ctx,
                                                  *global_obj,
                                                  request->method != NULL ? request->method : "GET",
                                                  url != NULL ? url : (request->path != NULL ? request->path : "/"),
                                                  request->path != NULL ? request->path : "/",
                                                  route_text,
                                                  mount_path,
                                                  relative_path,
                                                  request->query_string != NULL ? request->query_string : "",
                                                  *query_obj,
                                                  *headers_value,
                                                  *body_value);
    heap_caps_free(url);
    JS_PopGCRef(ctx, &body_ref);
    JS_PopGCRef(ctx, &headers_value_ref);
    JS_PopGCRef(ctx, &headers_ref);
    JS_PopGCRef(ctx, &query_ref);
    JS_PopGCRef(ctx, &global_ref);
    return !JS_IsException(*out_obj);

fail:
    heap_caps_free(url);
    JS_PopGCRef(ctx, &body_ref);
    JS_PopGCRef(ctx, &headers_value_ref);
    JS_PopGCRef(ctx, &headers_ref);
    JS_PopGCRef(ctx, &query_ref);
    JS_PopGCRef(ctx, &global_ref);
    *out_obj = JS_EXCEPTION;
    return false;
}

static int http_server_parse_status(JSContext *ctx, JSValue value, int32_t *out_status)
{
    int status = 0;

    if (JS_IsUndefined(value) || JS_IsNull(value)) {
        *out_status = 200;
        return 0;
    }
    if (JS_ToInt32(ctx, &status, value) != 0 || status < 100 || status > 599) {
        return -1;
    }
    *out_status = status;
    return 0;
}

static int http_server_parse_headers(JSContext *ctx,
                                     JSValue *value,
                                     esp32_mquickjs_http_server_header_t **out_headers,
                                     size_t *out_count)
{
    JSGCRef global_ref;
    JSGCRef object_ref;
    JSGCRef keys_ref;
    JSGCRef keys_array_ref;
    JSGCRef length_ref;
    JSValue *global_obj;
    JSValue *object_ctor;
    JSValue *keys_fn;
    JSValue *keys_array;
    JSValue *length_value;
    esp32_mquickjs_http_server_header_t *headers = NULL;
    int length = 0;
    int i;

    *out_headers = NULL;
    *out_count = 0;
    if (JS_IsUndefined(*value) || JS_IsNull(*value)) {
        return 0;
    }
    if (esp32_mquickjs_is_headers_object(ctx, *value)) {
        *value = esp32_mquickjs_headers_to_plain_object(ctx, *value);
        if (JS_IsException(*value)) {
            return -1;
        }
    }
    if (!http_server_is_object(ctx, *value)) {
        return -1;
    }

    global_obj = JS_PushGCRef(ctx, &global_ref);
    object_ctor = JS_PushGCRef(ctx, &object_ref);
    keys_fn = JS_PushGCRef(ctx, &keys_ref);
    keys_array = JS_PushGCRef(ctx, &keys_array_ref);
    length_value = JS_PushGCRef(ctx, &length_ref);

    *global_obj = JS_GetGlobalObject(ctx);
    if (JS_IsException(*global_obj)) {
        goto fail;
    }
    *object_ctor = JS_GetPropertyStr(ctx, *global_obj, "Object");
    if (JS_IsException(*object_ctor) || !JS_IsFunction(ctx, *object_ctor)) {
        goto fail;
    }
    *keys_fn = JS_GetPropertyStr(ctx, *object_ctor, "keys");
    if (JS_IsException(*keys_fn) || !JS_IsFunction(ctx, *keys_fn)) {
        goto fail;
    }
    *keys_array = http_server_call_function(ctx, *keys_fn, *object_ctor, 1, value);
    if (JS_IsException(*keys_array)) {
        goto fail;
    }
    *length_value = JS_GetPropertyStr(ctx, *keys_array, "length");
    if (JS_IsException(*length_value) || JS_ToInt32(ctx, &length, *length_value) != 0) {
        goto fail;
    }
    if (length <= 0) {
        JS_PopGCRef(ctx, &length_ref);
        JS_PopGCRef(ctx, &keys_array_ref);
        JS_PopGCRef(ctx, &keys_ref);
        JS_PopGCRef(ctx, &object_ref);
        JS_PopGCRef(ctx, &global_ref);
        return 0;
    }
    if (length > ESP32_MQUICKJS_HTTP_SERVER_MAX_HEADERS) {
        goto fail;
    }

    headers = heap_caps_calloc((size_t)length, sizeof(*headers), MALLOC_CAP_8BIT);
    if (headers == NULL) {
        goto fail;
    }

    for (i = 0; i < length; ++i) {
        JSGCRef key_ref;
        JSGCRef val_ref;
        JSValue *key;
        JSValue *val;
        JSCStringBuf key_buf;
        JSCStringBuf val_buf;
        const char *key_str;
        const char *val_str;
        char *key_copy;

        key = JS_PushGCRef(ctx, &key_ref);
        val = JS_PushGCRef(ctx, &val_ref);
        *key = JS_GetPropertyUint32(ctx, *keys_array, (uint32_t)i);
        if (JS_IsException(*key)) {
            JS_PopGCRef(ctx, &val_ref);
            JS_PopGCRef(ctx, &key_ref);
            goto fail;
        }
        key_str = JS_ToCString(ctx, *key, &key_buf);
        if (key_str == NULL) {
            JS_PopGCRef(ctx, &val_ref);
            JS_PopGCRef(ctx, &key_ref);
            goto fail;
        }
        key_copy = http_server_strdup(key_str);
        if (key_copy == NULL) {
            JS_PopGCRef(ctx, &val_ref);
            JS_PopGCRef(ctx, &key_ref);
            goto fail;
        }
        headers[i].key = key_copy;
        *val = JS_GetPropertyStr(ctx, *value, key_copy);
        if (JS_IsException(*val)) {
            JS_PopGCRef(ctx, &val_ref);
            JS_PopGCRef(ctx, &key_ref);
            goto fail;
        }
        val_str = JS_ToCString(ctx, *val, &val_buf);
        if (key_str == NULL || val_str == NULL) {
            JS_PopGCRef(ctx, &val_ref);
            JS_PopGCRef(ctx, &key_ref);
            goto fail;
        }

        headers[i].value = http_server_strdup(val_str);
        JS_PopGCRef(ctx, &val_ref);
        JS_PopGCRef(ctx, &key_ref);
        if (headers[i].value == NULL) {
            goto fail;
        }
    }

    JS_PopGCRef(ctx, &length_ref);
    JS_PopGCRef(ctx, &keys_array_ref);
    JS_PopGCRef(ctx, &keys_ref);
    JS_PopGCRef(ctx, &object_ref);
    JS_PopGCRef(ctx, &global_ref);
    *out_headers = headers;
    *out_count = (size_t)length;
    return 0;

