99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/http/esp32_mquickjs_http_server.c
fail:
    JS_PopGCRef(ctx, &length_ref);
    JS_PopGCRef(ctx, &keys_array_ref);
    JS_PopGCRef(ctx, &keys_ref);
    JS_PopGCRef(ctx, &object_ref);
    JS_PopGCRef(ctx, &global_ref);
    http_server_free_headers(headers, length > 0 ? (size_t)length : 0U);
    *out_headers = NULL;
    *out_count = 0;
    return -1;
}

static int http_server_make_response(JSContext *ctx,
                                     JSValue *value,
                                     esp32_mquickjs_http_server_response_t *out_response)
{
    JSGCRef status_ref;
    JSGCRef headers_ref;
    JSGCRef body_ref;
    JSValue *status_value;
    JSValue *headers_value;
    JSValue *body_value;
    JSGCRef status_text_ref;
    JSValue *status_text_value;
    JSCStringBuf status_text_buf;
    const char *status_text;

    memset(out_response, 0, sizeof(*out_response));
    out_response->status = 200;
    out_response->status_text = NULL;
    out_response->has_known_length = true;

    if (!esp32_mquickjs_is_response_object(ctx, *value)) {
        JS_ThrowTypeError(ctx, "http.server handlers must return a Response");
        return -1;
    }

    status_value = JS_PushGCRef(ctx, &status_ref);
    headers_value = JS_PushGCRef(ctx, &headers_ref);
    body_value = JS_PushGCRef(ctx, &body_ref);
    status_text_value = JS_PushGCRef(ctx, &status_text_ref);

    *status_value = JS_GetPropertyStr(ctx, *value, "status");
    *headers_value = JS_GetPropertyStr(ctx, *value, "headers");
    *body_value = JS_GetPropertyStr(ctx, *value, "body");
    *status_text_value = JS_GetPropertyStr(ctx, *value, "statusText");
    if (JS_IsException(*status_value) || JS_IsException(*headers_value) || JS_IsException(*body_value) ||
        JS_IsException(*status_text_value)) {
        goto fail;
    }
    if (http_server_parse_status(ctx, *status_value, &out_response->status) != 0) {
        goto fail;
    }
    if (http_server_parse_headers(ctx,
                                  headers_value,
                                  &out_response->headers,
                                  &out_response->header_count) != 0) {
        goto fail;
    }
    status_text = JS_IsUndefined(*status_text_value) || JS_IsNull(*status_text_value)
                      ? http_server_status_text(out_response->status)
                      : JS_ToCString(ctx, *status_text_value, &status_text_buf);
    if (status_text == NULL) {
        goto fail;
    }
    out_response->status_text = http_server_strdup(status_text);
    if (out_response->status_text == NULL) {
        goto fail;
    }
    if (!JS_IsUndefined(*body_value) && !JS_IsNull(*body_value)) {
        if (!esp32_mquickjs_fs_parse_stream_ref(ctx, *body_value, &out_response->body_stream_ref)) {
            JS_ThrowTypeError(ctx, "Response.body must be a Stream");
            goto fail;
        }
        out_response->has_body_stream = true;
        out_response->body_binary =
            esp32_mquickjs_stream_is_binary(&out_response->body_stream_ref);
        out_response->has_known_length = esp32_mquickjs_stream_known_length(
            &out_response->body_stream_ref, &out_response->known_length);
    }

    {
        size_t i;

        for (i = 0; i < out_response->header_count; ++i) {
            const char *cursor;
            char *end = NULL;
            unsigned long long parsed;

            if (strcasecmp(out_response->headers[i].key,
                           "Content-Length") != 0) {
                continue;
            }
            if (!out_response->has_known_length) {
                JS_ThrowTypeError(
                    ctx,
                    "Response Content-Length requires a body with known length");
                goto fail;
            }
            cursor = out_response->headers[i].value != NULL
                         ? out_response->headers[i].value
                         : "";
            while (isspace((unsigned char)*cursor)) {
                cursor++;
            }
            errno = 0;
            parsed = strtoull(cursor, &end, 10);
            while (end != NULL && isspace((unsigned char)*end)) {
                end++;
            }
            if (*cursor == '\0' || *cursor == '-' || errno != 0 ||
                end == cursor || end == NULL || *end != '\0' ||
                parsed > SIZE_MAX) {
                JS_ThrowTypeError(
                    ctx, "Response Content-Length must be a non-negative integer");
                goto fail;
            }
            if ((size_t)parsed != out_response->known_length) {
                JS_ThrowRangeError(
                    ctx,
                    "Response Content-Length (%llu) does not match the body (%u bytes)",
                    parsed, (unsigned)out_response->known_length);
                goto fail;
            }
        }
    }

    if (out_response->has_body_stream &&
        esp32_mquickjs_fs_stream_acquire(
            &out_response->body_stream_ref) != ESP_OK) {
        JS_ThrowInternalError(
            ctx, "Response.body stream is already in use");
        goto fail;
    }

    JS_PopGCRef(ctx, &status_text_ref);
    JS_PopGCRef(ctx, &body_ref);
    JS_PopGCRef(ctx, &headers_ref);
    JS_PopGCRef(ctx, &status_ref);
    return 0;

fail:
    JS_PopGCRef(ctx, &status_text_ref);
    JS_PopGCRef(ctx, &body_ref);
    JS_PopGCRef(ctx, &headers_ref);
    JS_PopGCRef(ctx, &status_ref);
    http_server_free_response(out_response);
    return -1;
}

static bool http_server_has_content_type(const esp32_mquickjs_http_server_response_t *response)
{
    size_t i;

    for (i = 0; i < response->header_count; ++i) {
        if (strcasecmp(response->headers[i].key, "content-type") == 0) {
            return true;
        }
    }
    return false;
}

static bool http_server_has_header(
    const esp32_mquickjs_http_server_response_t *response,
    const char *name)
{
    size_t i;

    for (i = 0; i < response->header_count; ++i) {
        if (strcasecmp(response->headers[i].key, name) == 0) {
            return true;
        }
    }
    return false;
}

static esp_err_t http_server_close_response_body(
    esp32_mquickjs_http_server_response_t *response)
{
    esp_err_t err;

    if (response == NULL || !response->has_body_stream) {
        return ESP_OK;
    }
    err = esp32_mquickjs_fs_stream_close(&response->body_stream_ref);
    response->has_body_stream = false;
    return err;
}

