99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/http/esp32_mquickjs_http_server.c
static esp_err_t http_server_raw_send_all(httpd_req_t *req,
                                          const char *data,
                                          size_t length)
{
    while (length > 0) {
        int sent = httpd_send(req, data, length);

        if (sent <= 0) {
            return ESP_ERR_HTTPD_RESP_SEND;
        }
        data += sent;
        length -= (size_t)sent;
    }
    return ESP_OK;
}

static esp_err_t http_server_send_known_length_response(
    httpd_req_t *req,
    esp32_mquickjs_http_server_response_t *response)
{
    char line[192];
    uint8_t *chunk_buffer = NULL;
    size_t sent_body = 0;
    size_t i;
    int line_len;
    esp_err_t err;

    line_len = snprintf(
        line, sizeof(line), "HTTP/1.1 %" PRId32 " %s\r\n",
        response->status,
        response->status_text != NULL
            ? response->status_text
            : http_server_status_text(response->status));
    if (line_len < 0 || (size_t)line_len >= sizeof(line)) {
        return ESP_ERR_HTTPD_RESP_HDR;
    }
    err = http_server_raw_send_all(req, line, (size_t)line_len);
    if (err != ESP_OK) {
        return err;
    }
    if (response->has_body_stream && !response->body_binary &&
        !http_server_has_content_type(response)) {
        static const char default_type[] =
            "Content-Type: text/plain; charset=utf-8\r\n";

        err = http_server_raw_send_all(req, default_type,
                                       sizeof(default_type) - 1);
        if (err != ESP_OK) {
            return err;
        }
    }
    if (!http_server_has_header(response, "Content-Length")) {
        line_len = snprintf(line, sizeof(line), "Content-Length: %u\r\n",
                            (unsigned)response->known_length);
        if (line_len < 0 || (size_t)line_len >= sizeof(line)) {
            return ESP_ERR_HTTPD_RESP_HDR;
        }
        err = http_server_raw_send_all(req, line, (size_t)line_len);
        if (err != ESP_OK) {
            return err;
        }
    }
    for (i = 0; i < response->header_count; ++i) {
        err = http_server_raw_send_all(req, response->headers[i].key,
                                       strlen(response->headers[i].key));
        if (err == ESP_OK) {
            err = http_server_raw_send_all(req, ": ", 2);
        }
        if (err == ESP_OK) {
            err = http_server_raw_send_all(
                req, response->headers[i].value,
                strlen(response->headers[i].value));
        }
        if (err == ESP_OK) {
            err = http_server_raw_send_all(req, "\r\n", 2);
        }
        if (err != ESP_OK) {
            return err;
        }
    }
    err = http_server_raw_send_all(req, "\r\n", 2);
    if (err != ESP_OK || !response->has_body_stream) {
        return err;
    }
    if (req->method == HTTP_HEAD) {
        return http_server_close_response_body(response);
    }

    chunk_buffer = esp32_mquickjs_memory_payload_alloc(
        "http-server.stream",
        ESP32_MQUICKJS_HTTP_SERVER_STREAM_CHUNK_SIZE,
        ESP32_MQUICKJS_MEMORY_EXTERNAL);
    if (chunk_buffer == NULL) {
        return ESP_ERR_NO_MEM;
    }
    while (sent_body < response->known_length) {
        size_t read_len = 0;

        err = esp32_mquickjs_fs_stream_read(
            &response->body_stream_ref, chunk_buffer,
            ESP32_MQUICKJS_HTTP_SERVER_STREAM_CHUNK_SIZE, &read_len);
        if (err != ESP_OK || read_len == 0 ||
            read_len > response->known_length - sent_body) {
            esp32_mquickjs_memory_payload_free(chunk_buffer);
            (void)http_server_close_response_body(response);
            return err != ESP_OK ? err : ESP_ERR_INVALID_SIZE;
        }
        err = http_server_raw_send_all(req, (const char *)chunk_buffer,
                                       read_len);
        if (err != ESP_OK) {
            esp32_mquickjs_memory_payload_free(chunk_buffer);
            (void)http_server_close_response_body(response);
            return err;
        }
        sent_body += read_len;
    }
    {
        uint8_t trailing_byte;
        size_t trailing_len = 0;

        err = esp32_mquickjs_fs_stream_read(
            &response->body_stream_ref, &trailing_byte, 1, &trailing_len);
        if (err != ESP_OK || trailing_len != 0) {
            esp32_mquickjs_memory_payload_free(chunk_buffer);
            (void)http_server_close_response_body(response);
            return err != ESP_OK ? err : ESP_ERR_INVALID_SIZE;
        }
    }
    esp32_mquickjs_memory_payload_free(chunk_buffer);
    return http_server_close_response_body(response);
}

static esp_err_t http_server_send_response(httpd_req_t *req,
                                           esp32_mquickjs_http_server_response_t *response)
{
    char status_line[32];
    uint8_t *chunk_buffer = NULL;
    size_t i;
    esp_err_t err;

    if (response->has_known_length) {
        return http_server_send_known_length_response(req, response);
    }

    snprintf(status_line,
             sizeof(status_line),
             "%" PRId32 " %s",
             response->status,
             response->status_text != NULL ? response->status_text : http_server_status_text(response->status));
    err = httpd_resp_set_status(req, status_line);
    if (err != ESP_OK) {
        return err;
    }
    if (response->has_body_stream && !response->body_binary &&
        !http_server_has_content_type(response)) {
        err = httpd_resp_set_type(req, "text/plain; charset=utf-8");
        if (err != ESP_OK) {
            return err;
        }
    }

    for (i = 0; i < response->header_count; ++i) {
        err = httpd_resp_set_hdr(req, response->headers[i].key, response->headers[i].value);
        if (err != ESP_OK) {
            return err;
        }
    }

    if (response->has_body_stream) {
        size_t read_len = 0;

        if (req->method == HTTP_HEAD) {
            err = http_server_close_response_body(response);
            if (err != ESP_OK) {
                return err;
            }
            return httpd_resp_send_chunk(req, NULL, 0);
        }
        chunk_buffer = esp32_mquickjs_memory_payload_alloc(
            "http-server.stream",
            ESP32_MQUICKJS_HTTP_SERVER_STREAM_CHUNK_SIZE,
            ESP32_MQUICKJS_MEMORY_EXTERNAL);
        if (chunk_buffer == NULL) {
            return ESP_ERR_NO_MEM;
        }
        do {
            err = esp32_mquickjs_fs_stream_read(&response->body_stream_ref,
                                                chunk_buffer,
                                                ESP32_MQUICKJS_HTTP_SERVER_STREAM_CHUNK_SIZE,
                                                &read_len);
            if (err != ESP_OK) {
                esp32_mquickjs_memory_payload_free(chunk_buffer);
                (void)http_server_close_response_body(response);
                return err;
            }
            if (read_len > 0) {
                err = httpd_resp_send_chunk(req, (const char *)chunk_buffer, read_len);
                if (err != ESP_OK) {
                    esp32_mquickjs_memory_payload_free(chunk_buffer);
                    (void)http_server_close_response_body(response);
                    return err;
                }
            }
        } while (read_len > 0);
        esp32_mquickjs_memory_payload_free(chunk_buffer);
        err = http_server_close_response_body(response);
        if (err != ESP_OK) {
            return err;
        }
        return httpd_resp_send_chunk(req, NULL, 0);
    }
    return httpd_resp_send(req, NULL, 0);
}

static int http_server_native_stop(void *handle, void *opaque)
{
    (void)opaque;
    return (int)httpd_stop((httpd_handle_t)handle);
}

static const esp32_mquickjs_http_server_resource_ops_t
    s_http_server_resource_ops = {
        .stop = http_server_native_stop,
        .opaque = NULL,
    };

static esp_err_t http_server_start_slot(
    esp32_mquickjs_http_server_slot_t *server)
{
    httpd_config_t config = HTTPD_DEFAULT_CONFIG();
    struct ifreq ifr;
    esp_err_t err;

