99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/http/esp32_mquickjs_http_server.c
    if (server == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    if (server->started) {
        return ESP_OK;
    }
    if (server->handle != NULL) {
        err = http_server_stop_slot(server);
        if (err != ESP_OK) {
            return err;
        }
    }

    err = esp32_mquickjs_net_ensure_initialized();
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "network runtime initialization failed before HTTP server start: %s",
                 esp_err_to_name(err));
        return err;
    }

    config.server_port = server->port;
    config.ctrl_port = server->ctrl_port;
    config.uri_match_fn = httpd_uri_match_wildcard;
    if (!http_server_resolve_ifreq_for_host(server->host, &ifr)) {
        ESP_LOGE(TAG, "failed to resolve HTTP server host binding for %s",
                 server->host != NULL ? server->host : "(null)");
        return ESP_ERR_INVALID_ARG;
    }
    if (!http_server_host_is_any(server->host)) {
        config.if_name = &ifr;
    }
    err = httpd_start(&server->handle, &config);
    if (err != ESP_OK) {
        return err;
    }

    memset(&server->dispatch_uri, 0, sizeof(server->dispatch_uri));
    server->dispatch_uri.uri = "/*";
    server->dispatch_uri.method = HTTP_ANY;
    server->dispatch_uri.handler = http_server_dispatch_handler;
    server->dispatch_uri.user_ctx = server;
    err = httpd_register_uri_handler(server->handle, &server->dispatch_uri);
    if (err != ESP_OK) {
        esp_err_t stop_err = http_server_stop_slot(server);

        return stop_err != ESP_OK ? stop_err : err;
    }

    server->started = true;
    return ESP_OK;
}

static esp_err_t http_server_stop_slot(
    esp32_mquickjs_http_server_slot_t *server)
{
    esp32_mquickjs_http_server_resources_t resources;
    esp_err_t err;
    int i;

    if (server == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    resources.handle = server->handle;
    err = (esp_err_t)esp32_mquickjs_http_server_resources_stop(
        &resources, &s_http_server_resource_ops);
    server->handle = (httpd_handle_t)resources.handle;
    if (err != ESP_OK) {
        return err;
    }

    server->started = false;
    for (i = 0; i < ESP32_MQUICKJS_HTTP_SERVER_MAX_ROUTES; ++i) {
        if (s_http_server_state.routes[i].allocated &&
            s_http_server_state.routes[i].server_id == server->server_id) {
            s_http_server_state.routes[i].registered = false;
        }
    }
    return ESP_OK;
}

static int http_server_clear_routes_for_server(JSContext *ctx, uint8_t server_id)
{
    int cleared = 0;
    int i;

    for (i = 0; i < ESP32_MQUICKJS_HTTP_SERVER_MAX_ROUTES; ++i) {
        if (s_http_server_state.routes[i].allocated &&
            s_http_server_state.routes[i].server_id == server_id) {
            http_server_cleanup_route(ctx, &s_http_server_state.routes[i]);
            cleared++;
        }
    }
    return cleared;
}

static void http_server_cleanup_requests_for_server(uint8_t server_id)
{
    int i;

    for (i = 0; i < ESP32_MQUICKJS_HTTP_SERVER_QUEUE_LEN; ++i) {
        if (s_http_server_state.requests[i].allocated &&
            s_http_server_state.requests[i].server_id == server_id) {
            http_server_cleanup_request(&s_http_server_state.requests[i]);
        }
    }
}

static bool http_server_has_active_response(uint8_t server_id)
{
    int i;

    for (i = 0; i < ESP32_MQUICKJS_HTTP_SERVER_QUEUE_LEN; ++i) {
        if (s_http_server_state.requests[i].allocated &&
            s_http_server_state.requests[i].server_id == server_id &&
            s_http_server_state.requests[i].responding) {
            return true;
        }
    }
    return false;
}

static esp_err_t http_server_close_slot(
    JSContext *ctx, esp32_mquickjs_http_server_slot_t *server)
{
    esp_err_t err;

    if (server == NULL) {
        return ESP_OK;
    }
    err = http_server_stop_slot(server);
    if (err != ESP_OK) {
        return err;
    }
    if (server->events != NULL) {
        esp32_mquickjs_event_queue_close(server->events);
    }
    http_server_cleanup_requests_for_server(server->server_id);
    (void)http_server_clear_routes_for_server(ctx, server->server_id);
    http_server_cleanup_server(server);
    return ESP_OK;
}

static esp_err_t http_server_cleanup_all(JSContext *ctx)
{
    esp_err_t err;
    int i;

    for (i = 0; i < ESP32_MQUICKJS_HTTP_SERVER_MAX_SERVERS; ++i) {
        esp32_mquickjs_http_server_slot_t *server =
            &s_http_server_state.servers[i];

        if (!server->allocated) {
            continue;
        }
        server->release_pending = true;
        err = http_server_close_slot(ctx, server);
        if (err != ESP_OK) {
            return err;
        }
    }
    for (i = 0; i < ESP32_MQUICKJS_HTTP_SERVER_QUEUE_LEN; ++i) {
        http_server_cleanup_request(&s_http_server_state.requests[i]);
    }
    for (i = 0; i < ESP32_MQUICKJS_HTTP_SERVER_MAX_ROUTES; ++i) {
        http_server_cleanup_route(ctx, &s_http_server_state.routes[i]);
    }
    return ESP_OK;
}

static int http_server_server_id_from_object(JSContext *ctx,
                                             JSValue server_value,
                                             const char *api_name,
                                             int32_t *out_server_id)
{
    esp32_mquickjs_http_server_ref_t *ref;
    esp32_mquickjs_http_server_slot_t *server;

    if (out_server_id == NULL || JS_GetClassID(ctx, server_value) != JS_CLASS_HTTP_SERVER) {
        JS_ThrowTypeError(ctx, "%s expects an HttpServer instance", api_name);
        return -1;
    }

    ref = JS_GetOpaque(ctx, server_value);
    if (ref == NULL) {
        JS_ThrowTypeError(ctx, "%s expects a valid HttpServer instance", api_name);
        return -1;
    }

    server = http_server_get_slot(ref->server_id);
    if (server == NULL || server->generation != ref->generation ||
        server->release_pending) {
        JS_ThrowInternalError(ctx, "%s cannot use a closed or stale HttpServer", api_name);
        return -1;
    }
    *out_server_id = ref->server_id;
    return 0;
}

