99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/http/esp32_mquickjs_http_server.c
static JSValue http_server_event_to_js(JSContext *ctx,
                                       const void *event_value,
                                       void *opaque)
{
    JSGCRef result_ref;
    const esp32_mquickjs_http_server_event_t *event = event_value;
    const esp32_mquickjs_http_server_event_source_t *source = opaque;
    esp32_mquickjs_http_server_request_t *request;
    esp32_mquickjs_http_server_route_t *route;
    JSValue *result;

    if (event == NULL || source == NULL ||
        event->request_id >= ESP32_MQUICKJS_HTTP_SERVER_QUEUE_LEN) {
        return JS_NULL;
    }
    request = &s_http_server_state.requests[event->request_id];
    if (!request->allocated || request->generation != event->generation ||
        request->server_id != source->server_id ||
        http_server_get_slot(source->server_id) == NULL ||
        http_server_get_slot(source->server_id)->generation != source->generation) {
        return JS_NULL;
    }
    route = http_server_find_route(ctx,
                                   request->server_id,
                                   request->method,
                                   request->path);
    if (route == NULL) {
        http_server_send_error(request->async_req, 404,
                               "Nothing matches the given URI");
        http_server_cleanup_request(request);
        return JS_NULL;
    }
    result = JS_PushGCRef(ctx, &result_ref);
    *result = JS_UNDEFINED;
    if (!http_server_make_request_object(ctx, request, route, result) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "_requestId",
                                         JS_NewInt32(ctx, request->request_id)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "_requestGeneration",
                                         JS_NewUint32(ctx, request->generation))) {
        http_server_send_error(request->async_req, 500,
                               "failed to build request object");
        http_server_cleanup_request(request);
        JS_PopGCRef(ctx, &result_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &result_ref);
}

static void http_server_event_drop(void *event_value, void *opaque)
{
    const esp32_mquickjs_http_server_event_t *event = event_value;
    const esp32_mquickjs_http_server_event_source_t *source = opaque;
    esp32_mquickjs_http_server_request_t *request;

    if (event == NULL || source == NULL ||
        event->request_id >= ESP32_MQUICKJS_HTTP_SERVER_QUEUE_LEN) {
        return;
    }
    request = &s_http_server_state.requests[event->request_id];
    if (!request->allocated || request->generation != event->generation ||
        request->server_id != source->server_id) {
        return;
    }
    http_server_send_error(request->async_req, 503, "request queue full");
    http_server_cleanup_request(request);
}

static void http_server_event_close(void *opaque)
{
    esp32_mquickjs_http_server_event_source_t *source = opaque;
    esp32_mquickjs_http_server_slot_t *server;

    if (source == NULL) {
        return;
    }
    server = http_server_get_slot(source->server_id);
    if (server != NULL && server->generation == source->generation) {
        server->events = NULL;
    }
    heap_caps_free(source);
}

static JSValue http_server_make_server_object(JSContext *ctx, JSValue global_obj, int32_t server_id)
{
    JSGCRef server_ref;
    JSGCRef events_ref;
    JSValue *server_obj;
    JSValue *events_obj;
    esp32_mquickjs_http_server_slot_t *server = http_server_get_slot(server_id);
    esp32_mquickjs_http_server_event_source_t *source = NULL;
    esp32_mquickjs_http_server_ref_t *ref = NULL;

    (void)global_obj;
    server_obj = JS_PushGCRef(ctx, &server_ref);
    events_obj = JS_PushGCRef(ctx, &events_ref);
    *server_obj = JS_NewObjectClassUser(ctx, JS_CLASS_HTTP_SERVER);
    *events_obj = JS_UNDEFINED;
    if (JS_IsException(*server_obj) || server == NULL) {
        goto fail;
    }
    ref = heap_caps_calloc(1, sizeof(*ref), MALLOC_CAP_8BIT);
    if (ref == NULL) {
        JS_ThrowOutOfMemory(ctx);
        goto fail;
    }
    ref->server_id = (uint8_t)server_id;
    ref->generation = server->generation;

    source = heap_caps_calloc(1, sizeof(*source), MALLOC_CAP_8BIT);
    if (source == NULL) {
        JS_ThrowOutOfMemory(ctx);
        goto fail;
    }
    source->server_id = (uint8_t)server_id;
    source->generation = server->generation;
    *events_obj = esp32_mquickjs_event_queue_new(
        ctx,
        s_http_server_state.runtime,
        sizeof(esp32_mquickjs_http_server_event_t),
        ESP32_MQUICKJS_HTTP_SERVER_QUEUE_LEN,
        ESP32_MQUICKJS_EVENT_QUEUE_DROP_NEWEST,
        http_server_event_to_js,
        http_server_event_drop,
        http_server_event_close,
        source);
    if (JS_IsException(*events_obj)) {
        heap_caps_free(source);
        source = NULL;
        goto fail;
    }
    source = NULL;
    server->events = esp32_mquickjs_event_queue_from_value(ctx, *events_obj);
    if (server->events == NULL) {
        goto fail;
    }

    if (!esp32_mquickjs_set_property_ref(ctx, server_obj, "port", JS_NewInt32(ctx, server->port)) ||
        !esp32_mquickjs_set_property_ref(ctx, server_obj, "ctrlPort", JS_NewInt32(ctx, server->ctrl_port)) ||
        !esp32_mquickjs_set_property_ref(ctx,
                                     server_obj,
                                     "host",
                                     JS_NewString(ctx,
                                                  server->host != NULL
                                                      ? server->host
                                                      : "0.0.0.0")) ||
        !esp32_mquickjs_set_property_ref(ctx, server_obj, "started", JS_NewBool(server->started)) ||
        !esp32_mquickjs_set_property_ref(ctx, server_obj, "closed", JS_FALSE) ||
        !esp32_mquickjs_set_property_ref(ctx, server_obj, "_eventQueue", *events_obj)) {
        goto fail;
    }
    JS_SetOpaque(ctx, *server_obj, ref);
    ref = NULL;

    JS_PopGCRef(ctx, &events_ref);
    return JS_PopGCRef(ctx, &server_ref);

