99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/http/esp32_mquickjs_http_server.c
fail:
    heap_caps_free(ref);
    heap_caps_free(source);
    JS_PopGCRef(ctx, &events_ref);
    JS_PopGCRef(ctx, &server_ref);
    return JS_EXCEPTION;
}

struct esp32_mquickjs_future_driver_state {
    JSContext *ctx;
    JSGCRef request_ref;
    JSGCRef server_ref;
    esp32_mquickjs_http_server_response_t response;
    uint8_t server_id;
    uint8_t request_id;
    uint32_t request_generation;
    esp_err_t send_result;
    _Atomic bool worker_completed;
    bool request_retained;
    bool server_retained;
    bool request_claimed;
    bool started;
    bool finished;
    bool cancelled;
};

static esp32_mquickjs_http_server_request_t *http_server_respond_request(
    const esp32_mquickjs_future_driver_state_t *state)
{
    esp32_mquickjs_http_server_request_t *request;

    if (state == NULL ||
        state->request_id >= ESP32_MQUICKJS_HTTP_SERVER_QUEUE_LEN) {
        return NULL;
    }
    request = &s_http_server_state.requests[state->request_id];
    return request->allocated &&
                   request->generation == state->request_generation &&
                   request->server_id == state->server_id
               ? request
               : NULL;
}

static void http_server_respond_release(
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL) {
        return;
    }
    http_server_free_response(&state->response);
    if (state->request_retained) {
        JS_DeleteGCRef(state->ctx, &state->request_ref);
        state->request_retained = false;
    }
    if (state->server_retained) {
        JS_DeleteGCRef(state->ctx, &state->server_ref);
        state->server_retained = false;
    }
    heap_caps_free(state);
}

static bool http_server_respond_future_capture(
    JSContext *ctx,
    JSGCRef *this_ref,
    int argc,
    JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    esp32_mquickjs_future_driver_state_t *state;
    esp32_mquickjs_http_server_request_t *request;
    JSGCRef request_id_ref;
    JSGCRef generation_ref;
    JSValue *request_id_value;
    JSValue *generation_value;
    uint32_t generation = 0;
    int request_id = -1;
    int32_t server_id = -1;

    if (out_state == NULL || argc != 2 || this_ref == NULL ||
        http_server_server_id_from_object(
            ctx, this_ref->val, "server.respond", &server_id) != 0) {
        if (!JS_HasException(ctx)) {
            JS_ThrowTypeError(
                ctx, "server.respond(request, response) expects two arguments");
        }
        return false;
    }
    request_id_value = JS_PushGCRef(ctx, &request_id_ref);
    generation_value = JS_PushGCRef(ctx, &generation_ref);
    *request_id_value = JS_GetPropertyStr(ctx, argv[0].val, "_requestId");
    *generation_value = JS_GetPropertyStr(
        ctx, argv[0].val, "_requestGeneration");
    if (JS_IsException(*request_id_value) ||
        JS_IsException(*generation_value) ||
        JS_ToInt32(ctx, &request_id, *request_id_value) != 0 ||
        JS_ToUint32(ctx, &generation, *generation_value) != 0 ||
        request_id < 0 ||
        request_id >= ESP32_MQUICKJS_HTTP_SERVER_QUEUE_LEN) {
        JS_PopGCRef(ctx, &generation_ref);
        JS_PopGCRef(ctx, &request_id_ref);
        JS_ThrowTypeError(
            ctx,
            "server.respond expects a live request returned by server.receive");
        return false;
    }
    JS_PopGCRef(ctx, &generation_ref);
    JS_PopGCRef(ctx, &request_id_ref);
    request = &s_http_server_state.requests[request_id];
    if (!request->allocated || request->generation != generation ||
        request->server_id != (uint8_t)server_id ||
        request->async_req == NULL || request->responding) {
        JS_ThrowInternalError(
            ctx, "server.respond cannot use a completed or stale request");
        return false;
    }
    state = heap_caps_calloc(1, sizeof(*state), MALLOC_CAP_8BIT);
    if (state == NULL) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    atomic_init(&state->worker_completed, false);
    state->ctx = ctx;
    state->server_id = (uint8_t)server_id;
    state->request_id = (uint8_t)request_id;
    state->request_generation = generation;
    state->send_result = ESP_FAIL;
    if (http_server_make_response(ctx, &argv[1].val, &state->response) != 0) {
        http_server_respond_release(state);
        return false;
    }
    *JS_AddGCRef(ctx, &state->request_ref) = argv[0].val;
    state->request_retained = true;
    *JS_AddGCRef(ctx, &state->server_ref) = this_ref->val;
    state->server_retained = true;
    request->responding = true;
    state->request_claimed = true;
    http_server_close_request_body(ctx, argv[0].val);
    if (!esp32_mquickjs_set_property_ref(
            ctx, &state->request_ref.val, "_requestId", JS_NewInt32(ctx, -1))) {
        request->responding = false;
        state->request_claimed = false;
        http_server_respond_release(state);
        return false;
    }
    *out_state = state;
    return true;
}

static void http_server_respond_worker(void *opaque)
{
    esp32_mquickjs_future_driver_state_t *state = opaque;
    esp32_mquickjs_http_server_request_t *request =
        http_server_respond_request(state);

    if (state != NULL && request != NULL && request->async_req != NULL) {
        state->send_result = http_server_send_response(
            request->async_req, &state->response);
    }
    if (state != NULL) {
        atomic_store_explicit(
            &state->worker_completed, true, memory_order_release);
    }
}

static bool http_server_respond_future_start(
    JSContext *ctx,
    esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token,
    esp32_mquickjs_future_driver_state_t *state)
{
    esp32_mquickjs_http_server_request_t *request =
        http_server_respond_request(state);

    if (state == NULL || request == NULL || !request->responding ||
        request->async_req == NULL || s_http_server_state.shutting_down) {
        JS_ThrowReferenceError(
            ctx, "HTTP request closed before response started");
        return false;
    }
    state->started = true;
    if (!esp32_mquickjs_future_submit_worker(
            runtime, token, http_server_respond_worker, state)) {
        state->started = false;
        JS_ThrowInternalError(ctx, "HTTP response worker queue is full");
        return false;
    }
    return true;
}

static esp32_mquickjs_future_poll_t http_server_respond_future_poll(
    esp32_mquickjs_future_driver_state_t *state)
{
    return state != NULL && atomic_load_explicit(
                                &state->worker_completed,
                                memory_order_acquire)
               ? ESP32_MQUICKJS_FUTURE_READY
               : ESP32_MQUICKJS_FUTURE_PENDING;
}

static JSValue http_server_respond_future_finish(
    JSContext *ctx,
    esp32_mquickjs_future_driver_state_t *state)
{
    esp32_mquickjs_http_server_request_t *request =
        http_server_respond_request(state);
    esp_err_t send_result;

    if (state == NULL || state->cancelled) {
        return JS_ThrowInternalError(ctx, "HTTP response was cancelled");
    }
    send_result = state->send_result;
    http_server_free_response(&state->response);
    if (request != NULL) {
        request->responding = false;
        http_server_cleanup_request(request);
    }
    state->request_claimed = false;
    state->finished = true;
    if (send_result != ESP_OK) {
        return JS_ThrowInternalError(ctx, "failed to send HTTP response");
    }
    return JS_TRUE;
}

static esp32_mquickjs_cancel_result_t http_server_respond_future_cancel(
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL || state->finished || state->cancelled) {
        return ESP32_MQUICKJS_CANCEL_REJECTED;
    }
    if (state->started) {
        return ESP32_MQUICKJS_CANCEL_REJECTED;
    }
    state->cancelled = true;
    atomic_store_explicit(
        &state->worker_completed, true, memory_order_release);
    return ESP32_MQUICKJS_CANCELLED;
}

