99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/http/esp32_mquickjs_http_server.c
static void http_server_respond_future_destroy(
    esp32_mquickjs_future_driver_state_t *state)
{
    esp32_mquickjs_http_server_request_t *request =
        http_server_respond_request(state);

    if (state == NULL) {
        return;
    }
    if (state->request_claimed && request != NULL) {
        if (state->started && atomic_load_explicit(
                                  &state->worker_completed,
                                  memory_order_acquire)) {
            request->responding = false;
            http_server_cleanup_request(request);
        } else {
            request->responding = false;
            if (state->request_retained) {
                (void)esp32_mquickjs_set_property_ref(
                    state->ctx, &state->request_ref.val, "_requestId",
                    JS_NewInt32(state->ctx, state->request_id));
            }
        }
    }
    http_server_respond_release(state);
}

static const esp32_mquickjs_future_driver_t s_http_server_respond_driver = {
    .capture = http_server_respond_future_capture,
    .start = http_server_respond_future_start,
    .poll = http_server_respond_future_poll,
    .finish = http_server_respond_future_finish,
    .cancel = http_server_respond_future_cancel,
    .destroy = http_server_respond_future_destroy,
};

bool esp32_mquickjs_init_http_server_runtime(JSContext *ctx,
                                             esp32_mquickjs_runtime_t *runtime)
{
    JSGCRef object_ref;
    JSGCRef receive_ref;
    JSGCRef respond_ref;
    JSValue *object;
    JSValue *receive;
    JSValue *respond;
    bool registered;
    esp_err_t err;

    err = http_server_init_state(ctx, runtime);
    if (err != ESP_OK) {
        JS_ThrowInternalError(ctx,
                              "HTTP server runtime cleanup failed: %s",
                              esp_err_to_name(err));
        return false;
    }
    object = JS_PushGCRef(ctx, &object_ref);
    receive = JS_PushGCRef(ctx, &receive_ref);
    respond = JS_PushGCRef(ctx, &respond_ref);
    *object = JS_NewObjectClassUser(ctx, JS_CLASS_HTTP_SERVER);
    *receive = JS_IsException(*object)
        ? JS_EXCEPTION : JS_GetPropertyStr(ctx, *object, "receive");
    *respond = JS_IsException(*object)
        ? JS_EXCEPTION : JS_GetPropertyStr(ctx, *object, "respond");
    registered = !JS_IsException(*receive) && !JS_IsException(*respond) &&
                 esp32_mquickjs_event_queue_register_receive_alias(
                     ctx, runtime, *receive) &&
                 esp32_mquickjs_future_register_driver(
                     ctx, runtime, *respond, &s_http_server_respond_driver);
    if (!registered && !JS_IsException(*object) &&
        !JS_IsException(*receive) && !JS_IsException(*respond)) {
        JS_ThrowInternalError(
            ctx, "failed to register HttpServer Future drivers");
    }
    JS_PopGCRef(ctx, &respond_ref);
    JS_PopGCRef(ctx, &receive_ref);
    JS_PopGCRef(ctx, &object_ref);
    return registered;
}

JSValue js_http_server_constructor(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_ThrowTypeError(ctx, "HttpServer cannot be constructed directly");
}

void js_http_server_finalizer(JSContext *ctx, void *opaque)
{
    esp32_mquickjs_http_server_ref_t *ref = opaque;
    esp32_mquickjs_http_server_slot_t *server;

    if (ref == NULL) {
        return;
    }
    server = http_server_get_slot(ref->server_id);
    if (server != NULL && server->generation == ref->generation) {
        server->release_pending = true;
        (void)http_server_close_slot(ctx, server);
    }
    heap_caps_free(ref);
}

JSValue js_http_server_start(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    int32_t server_id = -1;
    esp32_mquickjs_http_server_slot_t *server;
    bool was_started;
    esp_err_t err;

    (void)argc;
    (void)argv;
    if (http_server_server_id_from_object(ctx, *this_val, "server.start", &server_id) != 0) {
        return JS_EXCEPTION;
    }
    server = http_server_get_slot(server_id);
    was_started = server->started;
    err = http_server_start_slot(server);
    if (err != ESP_OK) {
        return JS_ThrowInternalError(ctx,
                                     "failed to start HTTP server: %s",
                                     esp_err_to_name(err));
    }
    esp32_mquickjs_set_property_ref(ctx, this_val, "started", JS_TRUE);
    return JS_NewBool(!was_started);
}

JSValue js_http_server_stop(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    int32_t server_id = -1;
    esp32_mquickjs_http_server_slot_t *server;
    bool was_started;
    esp_err_t err;

    (void)argc;
    (void)argv;
    if (http_server_server_id_from_object(ctx, *this_val, "server.stop", &server_id) != 0) {
        return JS_EXCEPTION;
    }
    if (http_server_has_active_response((uint8_t)server_id)) {
        return JS_ThrowInternalError(
            ctx, "server.stop() refused while a response is pending");
    }
    server = http_server_get_slot(server_id);
    was_started = server->started;
    err = http_server_stop_slot(server);
    if (err != ESP_OK) {
        return JS_ThrowInternalError(ctx,
                                     "failed to stop HTTP server: %s",
                                     esp_err_to_name(err));
    }
    esp32_mquickjs_set_property_ref(ctx, this_val, "started", JS_FALSE);
    return JS_NewBool(was_started);
}

JSValue js_http_server_close(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    JSGCRef closed_ref;
    JSValue *closed_value;
    esp32_mquickjs_http_server_ref_t *ref;
    esp32_mquickjs_http_server_slot_t *server;
    int32_t server_id = -1;
    esp_err_t err;

    (void)argc;
    (void)argv;
    if (JS_GetClassID(ctx, *this_val) != JS_CLASS_HTTP_SERVER) {
        return JS_ThrowTypeError(ctx, "server.close expects an HttpServer instance");
    }
    closed_value = JS_PushGCRef(ctx, &closed_ref);
    *closed_value = JS_GetPropertyStr(ctx, *this_val, "closed");
    if (JS_IsException(*closed_value)) {
        JS_PopGCRef(ctx, &closed_ref);
        return JS_EXCEPTION;
    }
    if (*closed_value == JS_TRUE) {
        JS_PopGCRef(ctx, &closed_ref);
        return JS_FALSE;
    }
    JS_PopGCRef(ctx, &closed_ref);

