99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/http/esp32_mquickjs_http_server.c
    ref = JS_GetOpaque(ctx, *this_val);
    if (ref == NULL) {
        return JS_ThrowTypeError(
            ctx, "server.close expects a valid HttpServer instance");
    }
    server_id = ref->server_id;
    server = http_server_get_slot(server_id);
    if (server == NULL || server->generation != ref->generation) {
        return JS_ThrowInternalError(
            ctx, "server.close cannot use a closed or stale HttpServer");
    }
    if (http_server_has_active_response((uint8_t)server_id)) {
        return JS_ThrowInternalError(
            ctx, "server.close() refused while a response is pending");
    }
    server->release_pending = true;
    err = http_server_close_slot(ctx, server);
    if (err != ESP_OK) {
        return JS_ThrowInternalError(ctx,
                                     "failed to close HTTP server: %s",
                                     esp_err_to_name(err));
    }
    JS_SetOpaque(ctx, *this_val, NULL);
    heap_caps_free(ref);
    if (!esp32_mquickjs_set_property_ref(ctx, this_val, "started", JS_FALSE) ||
        !esp32_mquickjs_set_property_ref(ctx, this_val, "closed", JS_TRUE)) {
        return JS_EXCEPTION;
    }
    return JS_TRUE;
}

JSValue js_http_server_receive(JSContext *ctx, JSValue *this_val,
                               int argc, JSValue *argv)
{
    JSGCRef server_ref;
    JSGCRef events_ref;
    JSGCRef receive_ref;
    JSValue *server_obj = JS_PushGCRef(ctx, &server_ref);
    JSValue *events_obj = JS_PushGCRef(ctx, &events_ref);
    JSValue *receive_fn = JS_PushGCRef(ctx, &receive_ref);
    JSValue result;
    int32_t server_id = -1;

    *server_obj = this_val != NULL ? *this_val : JS_UNDEFINED;
    *events_obj = JS_UNDEFINED;
    *receive_fn = JS_UNDEFINED;
    if (http_server_server_id_from_object(ctx, *server_obj,
                                          "server.receive", &server_id) != 0) {
        result = JS_EXCEPTION;
        goto done;
    }
    *events_obj = JS_GetPropertyStr(ctx, *server_obj, "_eventQueue");
    *receive_fn = JS_IsException(*events_obj)
                      ? JS_EXCEPTION
                      : JS_GetPropertyStr(ctx, *events_obj, "receive");
    if (JS_IsException(*events_obj) || JS_IsException(*receive_fn)) {
        result = JS_EXCEPTION;
        goto done;
    }
    result = esp32_mquickjs_future_call_and_wait(
        ctx, esp32_mquickjs_get_active_runtime(), *receive_fn,
        *events_obj, argc, argv);

done:
    JS_PopGCRef(ctx, &receive_ref);
    JS_PopGCRef(ctx, &events_ref);
    JS_PopGCRef(ctx, &server_ref);
    return result;
}

JSValue js_http_server_stats(JSContext *ctx, JSValue *this_val,
                             int argc, JSValue *argv)
{
    JSGCRef events_ref;
    JSGCRef stats_ref;
    JSValue *events = JS_PushGCRef(ctx, &events_ref);
    JSValue *stats = JS_PushGCRef(ctx, &stats_ref);
    JSValue result;
    int32_t server_id = -1;

    (void)argc;
    (void)argv;
    if (this_val == NULL ||
        http_server_server_id_from_object(
            ctx, *this_val, "server.stats", &server_id) != 0) {
        result = JS_EXCEPTION;
        goto done;
    }
    *events = JS_GetPropertyStr(ctx, *this_val, "_eventQueue");
    *stats = JS_IsException(*events)
                 ? JS_EXCEPTION
                 : JS_GetPropertyStr(ctx, *events, "stats");
    result = JS_IsException(*events) || JS_IsException(*stats)
                 ? JS_EXCEPTION
                 : http_server_call_function(
                       ctx, *stats, *events, 0, NULL);

done:
    JS_PopGCRef(ctx, &stats_ref);
    JS_PopGCRef(ctx, &events_ref);
    return result;
}

JSValue js_http_server_clear_routes(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    int32_t server_id = -1;
    int cleared;

    (void)argc;
    (void)argv;
    if (http_server_server_id_from_object(ctx, *this_val, "server.clearRoutes", &server_id) != 0) {
        return JS_EXCEPTION;
    }
    cleared = http_server_clear_routes_for_server(ctx, (uint8_t)server_id);
    return JS_NewInt32(ctx, cleared);
}

JSValue js_http_server_remove_route(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_http_server_route_t pattern = {0};
    JSGCRef pattern_ref;
    JSValue *rooted_pattern;
    httpd_method_t method = HTTP_ANY;
    bool filter_method = false;
    int32_t server_id = -1;
    int removed = 0;
    int i;

    if (http_server_server_id_from_object(ctx, *this_val, "server.removeRoute", &server_id) != 0) {
        return JS_EXCEPTION;
    }
    if (argc < 1 || !JS_IsString(ctx, argv[0])) {
        return JS_ThrowTypeError(ctx, "server.removeRoute(path, method?) expects a string path");
    }
    if (argc >= 2 && !JS_IsUndefined(argv[1]) && !JS_IsNull(argv[1])) {
        JSCStringBuf method_buf;
        const char *method_name;

        if (!JS_IsString(ctx, argv[1])) {
            return JS_ThrowTypeError(ctx, "server.removeRoute(..., method) expects an HTTP method string");
        }
        method_name = JS_ToCString(ctx, argv[1], &method_buf);
        if (method_name == NULL) {
            return JS_EXCEPTION;
        }
        if (strcasecmp(method_name, "GET") == 0) {
            method = HTTP_GET;
        } else if (strcasecmp(method_name, "POST") == 0) {
            method = HTTP_POST;
        } else if (strcasecmp(method_name, "PUT") == 0) {
            method = HTTP_PUT;
        } else if (strcasecmp(method_name, "PATCH") == 0) {
            method = HTTP_PATCH;
        } else if (strcasecmp(method_name, "DELETE") == 0) {
            method = HTTP_DELETE;
        } else if (strcasecmp(method_name, "HEAD") == 0) {
            method = HTTP_HEAD;
        } else if (strcasecmp(method_name, "OPTIONS") == 0) {
            method = HTTP_OPTIONS;
        } else if (strcasecmp(method_name, "ANY") != 0 && strcasecmp(method_name, "ALL") != 0) {
            return JS_ThrowTypeError(ctx, "server.removeRoute(..., method) received an unsupported HTTP method");
        }
        filter_method = true;
    }

    rooted_pattern = JS_PushGCRef(ctx, &pattern_ref);
    *rooted_pattern = argv[0];
    pattern.allocated = true;
    if (!http_server_compile_route_pattern(ctx, rooted_pattern, &pattern)) {
        http_server_cleanup_route(ctx, &pattern);
        JS_PopGCRef(ctx, &pattern_ref);
        return JS_ThrowTypeError(ctx, "server.removeRoute(path, method?) expects a valid string path");
    }

    for (i = 0; i < ESP32_MQUICKJS_HTTP_SERVER_MAX_ROUTES; ++i) {
        esp32_mquickjs_http_server_route_t *route = &s_http_server_state.routes[i];

        if (!route->allocated || route->server_id != (uint8_t)server_id ||
            route->match_with_regex != pattern.match_with_regex ||
            route->uri == NULL || pattern.uri == NULL || strcmp(route->uri, pattern.uri) != 0 ||
            (filter_method && route->method != method)) {
            continue;
        }
        http_server_cleanup_route(ctx, route);
        removed++;
    }

    http_server_cleanup_route(ctx, &pattern);
    JS_PopGCRef(ctx, &pattern_ref);
    return JS_NewInt32(ctx, removed);
}

JSValue js_http_server_route(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_http_server_route_t candidate = {0};
    esp32_mquickjs_http_server_route_t *route = NULL;
    JSGCRef path_ref;
    JSValue *path_value;
    JSCStringBuf method_buf;
    const char *method_name;
    httpd_method_t method;
    int32_t server_id = -1;
    int i;

    if (http_server_server_id_from_object(ctx, *this_val, "server.route", &server_id) != 0) {
        return JS_EXCEPTION;
    }
    if (argc < 2 || !JS_IsString(ctx, argv[0]) || !JS_IsString(ctx, argv[1])) {
        return JS_ThrowTypeError(ctx, "server.route(method, path) expects two strings");
    }
    method_name = JS_ToCString(ctx, argv[0], &method_buf);
    if (method_name == NULL) {
        return JS_EXCEPTION;
    }
    if (strcasecmp(method_name, "GET") == 0) {
        method = HTTP_GET;
    } else if (strcasecmp(method_name, "POST") == 0) {
        method = HTTP_POST;
    } else if (strcasecmp(method_name, "PUT") == 0) {
        method = HTTP_PUT;
    } else if (strcasecmp(method_name, "PATCH") == 0) {
        method = HTTP_PATCH;
    } else if (strcasecmp(method_name, "DELETE") == 0) {
        method = HTTP_DELETE;
    } else if (strcasecmp(method_name, "HEAD") == 0) {
        method = HTTP_HEAD;
    } else if (strcasecmp(method_name, "OPTIONS") == 0) {
        method = HTTP_OPTIONS;
    } else if (strcasecmp(method_name, "ANY") == 0 || strcasecmp(method_name, "ALL") == 0) {
        method = HTTP_ANY;
    } else {
        return JS_ThrowTypeError(ctx, "server.route received an unsupported HTTP method");
    }

    path_value = JS_PushGCRef(ctx, &path_ref);
    *path_value = argv[1];
    candidate.allocated = true;
    candidate.server_id = (uint8_t)server_id;
    candidate.method = method;
    if (!http_server_compile_route_pattern(ctx, path_value, &candidate)) {
        http_server_cleanup_route(ctx, &candidate);
        JS_PopGCRef(ctx, &path_ref);
        return JS_ThrowTypeError(ctx, "server.route(method, path) expects a valid string path");
    }
    JS_PopGCRef(ctx, &path_ref);

    for (i = 0; i < ESP32_MQUICKJS_HTTP_SERVER_MAX_ROUTES; ++i) {
        if (!s_http_server_state.routes[i].allocated) {
            uint8_t route_id = s_http_server_state.routes[i].route_id;

            route = &s_http_server_state.routes[i];
            *route = candidate;
            route->route_id = route_id;
            memset(&candidate, 0, sizeof(candidate));
            break;
        }
    }
    if (route == NULL) {
        http_server_cleanup_route(ctx, &candidate);
        return JS_ThrowInternalError(ctx, "too many server routes");
    }
    return JS_TRUE;
}

static void http_server_close_request_body(JSContext *ctx, JSValue request_value)
{
    JSGCRef body_ref;
    JSValue *body_value = JS_PushGCRef(ctx, &body_ref);

    *body_value = JS_GetPropertyStr(ctx, request_value, "body");
    if (!JS_IsException(*body_value)) {
        esp32_mquickjs_stream_close_value(ctx, *body_value);
    }
    JS_PopGCRef(ctx, &body_ref);
}

