99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/http/esp32_mquickjs_http_server.c
JSValue js_http_server_respond(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    JSGCRef method_ref;
    JSValue *method = JS_PushGCRef(ctx, &method_ref);
    JSValue result;

    *method = this_val != NULL
                  ? JS_GetPropertyStr(ctx, *this_val, "respond")
                  : JS_EXCEPTION;
    result = JS_IsException(*method)
                 ? JS_EXCEPTION
                 : esp32_mquickjs_future_call_and_wait(
                       ctx, esp32_mquickjs_get_active_runtime(), *method,
                       *this_val, argc, argv);
    JS_PopGCRef(ctx, &method_ref);
    return result;
}

JSValue js_http_server_create(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    JSGCRef options_ref;
    JSGCRef port_ref;
    JSGCRef host_ref;
    JSGCRef global_ref;
    JSValue *options;
    JSValue *port_value;
    JSValue *host_value;
    JSValue *global_obj;
    httpd_config_t default_config = HTTPD_DEFAULT_CONFIG();
    int port = 80;
    int ctrl_port = default_config.ctrl_port;
    const char *host = "0.0.0.0";
    JSCStringBuf host_buf;
    int i;
    esp_err_t err;
    esp32_mquickjs_http_server_slot_t *server = NULL;

    (void)this_val;
    options = JS_PushGCRef(ctx, &options_ref);
    port_value = JS_PushGCRef(ctx, &port_ref);
    host_value = JS_PushGCRef(ctx, &host_ref);
    global_obj = JS_PushGCRef(ctx, &global_ref);
    *options = argc >= 1 ? argv[0] : JS_UNDEFINED;
    *port_value = JS_UNDEFINED;
    *host_value = JS_UNDEFINED;
    *global_obj = JS_GetGlobalObject(ctx);
    if (JS_IsException(*global_obj)) {
        JS_PopGCRef(ctx, &global_ref);
        JS_PopGCRef(ctx, &host_ref);
        JS_PopGCRef(ctx, &port_ref);
        JS_PopGCRef(ctx, &options_ref);
        return JS_EXCEPTION;
    }

    if (!JS_IsUndefined(*options) && !JS_IsNull(*options)) {
        if (!http_server_is_object(ctx, *options)) {
            JS_PopGCRef(ctx, &global_ref);
            JS_PopGCRef(ctx, &host_ref);
            JS_PopGCRef(ctx, &port_ref);
            JS_PopGCRef(ctx, &options_ref);
            return JS_ThrowTypeError(ctx, "http.server(options) expects an object");
        }
        *port_value = JS_GetPropertyStr(ctx, *options, "port");
        *host_value = JS_GetPropertyStr(ctx, *options, "host");
        if (JS_IsException(*port_value) || JS_IsException(*host_value)) {
            JS_PopGCRef(ctx, &global_ref);
            JS_PopGCRef(ctx, &host_ref);
            JS_PopGCRef(ctx, &port_ref);
            JS_PopGCRef(ctx, &options_ref);
            return JS_EXCEPTION;
        }
        if (!JS_IsUndefined(*port_value) && !JS_IsNull(*port_value)) {
            if (JS_ToInt32(ctx, &port, *port_value) != 0 || port <= 0 || port > 65535) {
                JS_PopGCRef(ctx, &global_ref);
                JS_PopGCRef(ctx, &host_ref);
                JS_PopGCRef(ctx, &port_ref);
                JS_PopGCRef(ctx, &options_ref);
                return JS_ThrowTypeError(ctx, "http.server({ port }) expects a valid TCP port");
            }
        }
        if (!JS_IsUndefined(*host_value) && !JS_IsNull(*host_value)) {
            if (!JS_IsString(ctx, *host_value)) {
                JS_PopGCRef(ctx, &global_ref);
                JS_PopGCRef(ctx, &host_ref);
                JS_PopGCRef(ctx, &port_ref);
                JS_PopGCRef(ctx, &options_ref);
                return JS_ThrowTypeError(ctx, "http.server({ host }) expects an IPv4 address string");
            }
            host = JS_ToCString(ctx, *host_value, &host_buf);
            if (host == NULL) {
                JS_PopGCRef(ctx, &global_ref);
                JS_PopGCRef(ctx, &host_ref);
                JS_PopGCRef(ctx, &port_ref);
                JS_PopGCRef(ctx, &options_ref);
                return JS_EXCEPTION;
            }
        }
    }

    for (i = 0; i < ESP32_MQUICKJS_HTTP_SERVER_MAX_SERVERS; ++i) {
        server = &s_http_server_state.servers[i];
        if (!server->allocated || !server->release_pending) {
            continue;
        }
        err = http_server_close_slot(ctx, server);
        if (err != ESP_OK) {
            JS_PopGCRef(ctx, &global_ref);
            JS_PopGCRef(ctx, &host_ref);
            JS_PopGCRef(ctx, &port_ref);
            JS_PopGCRef(ctx, &options_ref);
            return JS_ThrowInternalError(
                ctx, "HTTP server pending cleanup failed: %s",
                esp_err_to_name(err));
        }
    }
    server = NULL;

    http_server_lock();
    for (i = 0; i < ESP32_MQUICKJS_HTTP_SERVER_MAX_SERVERS; ++i) {
        if (!s_http_server_state.servers[i].allocated) {
            server = &s_http_server_state.servers[i];
            server->allocated = true;
            server->generation++;
            if (server->generation == 0) {
                server->generation++;
            }
            server->port = (uint16_t)port;
            server->ctrl_port = (uint16_t)(ctrl_port + i);
            server->host = http_server_strdup(host);
            server->started = false;
            server->release_pending = false;
            server->handle = NULL;
            if (server->host == NULL) {
                http_server_cleanup_server(server);
                server = NULL;
            }
            break;
        }
    }
    http_server_unlock();

    if (server == NULL) {
        JS_PopGCRef(ctx, &global_ref);
        JS_PopGCRef(ctx, &host_ref);
        JS_PopGCRef(ctx, &port_ref);
        JS_PopGCRef(ctx, &options_ref);
        return JS_ThrowInternalError(ctx, "failed to allocate HTTP server");
    }

    {
        JSValue result = http_server_make_server_object(ctx, *global_obj, server->server_id);

        if (JS_IsException(result)) {
            server->release_pending = true;
            (void)http_server_close_slot(ctx, server);
        }
        JS_PopGCRef(ctx, &global_ref);
        JS_PopGCRef(ctx, &host_ref);
        JS_PopGCRef(ctx, &port_ref);
        JS_PopGCRef(ctx, &options_ref);
        return result;
    }
}

void esp32_mquickjs_deinit_http_server_runtime(JSContext *ctx)
{
    esp_err_t err;

    if (!s_http_server_state.initialized) {
        http_server_reset_state();
        return;
    }

    s_http_server_state.shutting_down = true;
    s_http_server_state.runtime = NULL;
    err = http_server_cleanup_all(ctx);
    if (err != ESP_OK) {
        ESP_LOGE(TAG,
                 "HTTP server runtime cleanup retained for retry: %s",
                 esp_err_to_name(err));
        return;
    }
    http_server_reset_state();
}

#endif
